{"title":"Sur la piste de M. Big Foot","data":{"stitches":{"bonjourAgentQC":{"content":["Bonjour *-Agent QC. -*",{"divert":"iveSentYouThisMe"},{"pageNum":1},{"pageLabel":" Intro"}]},"iveSentYouThisMe":{"content":["I've sent you this message to inform you of a top-secret, high priority mission: you need to hunt down and capture the master criminal known as Mister Big Foot. ",{"divert":"becauseTheCrimin"}]},"becauseTheCrimin":{"content":["Because the criminal in question is located in the exotic province of Ontario, we will not be able to operate as openly as we would here in Québec. Therefore you will be undercover and our communication will need to be primarily /=en Anglais=/ for the time being.",{"divert":"toProceedWithYou"}]},"toProceedWithYou":{"content":["To proceed with your mission, *-YOU will need to choose how to act at each step of the investigation by clicking on the choice you wish to  make-* - we'll take care of the rest.",{"divert":"bonneChanceAgent"}]},"bonneChanceAgent":{"content":["Bonne chance, Agent QC. Vous êtes le seul à pouvoir arrêter Big Foot.",{"option":"Commencer l'enquête. ","linkPath":"mrBigFootIsKnown","ifConditions":null,"notIfConditions":null}]},"mrBigFootIsKnown":{"content":["Mr. Big Foot is known to invest illegally in various stocks and bonds. Because of his use of Index Funds, he has his fingers in many different pies. From your secret base here at McGill College Plaza in Montréal, you can plan your approach and gather information until you are ready to move out and try to physically apprehend Mr. Big Foot.",{"divert":"youRememberThatY"},{"pageNum":2},{"pageLabel":"Start of investigation"}]},"youRememberThatY":{"content":["You remember that you could always reach out to your old buddy, CEO Jens Jansen, while checking for unsual stock market activity.",{"divert":"whatIsYourNextSt"},{"ifCondition":"can contact jens hansen"}]},"youReachOutToThe":{"content":["You reach out to the Mounted Police Special Active Futuristic Division (MPSAFD), Québec's most elite law-enforcement agency. Your connections there should be able to help you get any available information on Mr. Big Foot.",{"divert":"aThickDossierArr"},{"flagName":"saw mpsafd briefing"},{"pageNum":3},{"pageLabel":"MPSAFD"}]},"aThickDossierArr":{"content":["A thick dossier arrives on your desk: apparently Mr. Big Foot is paranoid about possible surveillance and is careful not to appear in public or otherwise allow themselves to be easily photographed. A vague description of Mr. Big Foot and his partner \"Mrs. H\" is available, and could help you identify them if you can see them in person.",{"divert":"thoughHeHasTaken"}]},"thoughHeHasTaken":{"content":["Though he has taken many precautions to avoid being tracked down, all men have their weaknesses, and Mr. Big Foot is no exception:",{"divert":"heIsKnownToIndul"}]},"heIsKnownToIndul":{"content":["He is known to indulge in *-expensive cheeses-* and crackers, channeling considerable funds into keeping himself well-stocked. ",{"divert":"heAlsoHasAPencha"}]},"heAlsoHasAPencha":{"content":["He also has a penchant for cats, and is known to take extremely good care of two cats. Their names are *-Solomon, -*a friendly-but-stupid black cat and *-Blue, -*a shy but clever grey cat.",{"divert":"thankingTheMPSAF"}]},"thankingTheMPSAF":{"content":["Thanking the MPSAFD for this information, you prepare to continue your hunt.",{"option":"Proceed with investigation","linkPath":"whatIsYourNextSt","ifConditions":null,"notIfConditions":null},{"pageNum":-1},{"pageLabel":"Investigation beginning"}]},"youKnowMrBigFoot":{"content":["You know Mr. Big Foot is active in the markets - it's time to take a look at recent price movements and volume and see if you can determine what he is up to.",{"divert":"whereShouldYouIn"},{"pageNum":4},{"pageLabel":"Stock Market"}]},"whereShouldYouIn":{"content":["Where should you investigate to find Mr. Big Foot's stock activity?",{"option":"Investigate Pharmaceutical stocks","linkPath":"youLookAtTheMove","ifConditions":null,"notIfConditions":[{"notIfCondition":"checked pharma stocks"}]},{"option":"Investigate Junior Mining stocks","linkPath":"drawingOnYourKno","ifConditions":null,"notIfConditions":[{"notIfCondition":"can contact jens hansen"}]},{"option":"Investigate The Vanguard Group","linkPath":"vanguardIsOneOfT","ifConditions":null,"notIfConditions":[{"notIfCondition":"checked vanguard"}]},{"option":"Finish with the stock market for now and continue the investigation.","linkPath":"whatIsYourNextSt","ifConditions":null,"notIfConditions":null},{"option":"Ask Jens Hansen about BFD movements","linkPath":"jensHansenAgrees","ifConditions":[{"ifCondition":"can contact jens hansen"}],"notIfConditions":[{"notIfCondition":"spoke to jens"}]},{"pageNum":-1}]},"youLookAtTheMove":{"content":["You look at the movement of pharmaceutical companies on the stock market, but although there is a a lot of rapid price action, none of it seems to point to Mr. Big Foot. This has not proven a good use of investigation time!",{"option":"Back to the drawing board.","linkPath":"whereShouldYouIn","ifConditions":null,"notIfConditions":null},{"flagName":"checked pharma stocks"}]},"drawingOnYourKno":{"content":["Drawing on your knowledge of Canadian junior mining stocks, you are easily able to analyze the movements. It doesn't take long before you notice two unusual trends: ",{"divert":"itSeemsLargeAmou"}]},"itSeemsLargeAmou":{"content":["It seems large amounts of shares in former junior company *-Beaufield -*- *-BFD -*(now acquired by Osisko) were purchased just ahead of a large price rise, indicating possible insider trading or another form of market manipulation.",{"divert":"itAlsoAppearsTha"}]},"itAlsoAppearsTha":{"content":["It also appears that FURY gold mines has seen a large influx of cash that suggests a large investor like Mr. Big Foot. ",{"divert":"youHavePersonalC"}]},"youHavePersonalC":{"content":["You have personal connections with former Beaufield CEO Jens Hansen - you could contact him for more information if you wish. You make a note of his contact information to follow up.",{"option":"Continue investigating","linkPath":"whereShouldYouIn","ifConditions":null,"notIfConditions":null},{"flagName":"can contact jens hansen"}]},"vanguardIsOneOfT":{"content":["Vanguard is one of the world's most popular providers of *-Index Funds. -*Knowing Mr. Big Foot's love of indexing, you suspect Vanguard will be able to point you in the right direction.",{"divert":"sureEnoughLookin"}]},"sureEnoughLookin":{"content":["Sure enough, looking at the price movements for various funds offered by Vanguard Canada, you see a pattern of regular purchasing that is consistent with Mr. Big Foot's financial habits. Cross-referencing the orders, you are able to narrow down the location to *-Waterloo, Ontario.-* Looks like you've got a lead!",{"option":"Continue investigation","linkPath":"whereShouldYouIn","ifConditions":null,"notIfConditions":null},{"flagName":"checked vanguard"},{"flagName":"know waterloo"}]},"jensHansenAgrees":{"content":["Jens Hansen agrees to meet with you after a quick phone call to his personal line - after all, you two are good friends after so many years together in the junior mining sector.",{"divert":"qCWhatCanIDoForY"}]},"qCWhatCanIDoForY":{"content":["\"QC, what can I do for you my old friend?\" says Jens as he pours you a small tumbler of Laphroaig and slides it across his marble desk. ",{"option":"Make small talk","linkPath":"youAndJensTalkFo","ifConditions":null,"notIfConditions":null},{"option":"Get straight to business and talk about the investigation","linkPath":"youExplainToJens","ifConditions":null,"notIfConditions":null}]},"youAndJensTalkFo":{"content":["You and Jens talk for some time regarding the recent price moves in FURY, Osisko, Eastmain, and many other companies in the area. ",{"divert":"agentQCSometimes"},{"pageNum":-1}]},"agentQCSometimes":{"content":["\"Agent QC, sometimes it seems like you know the Canadian mining industry better than I do! Maybe you should do my job for a while.\" You laugh and mention that that's part of why you came to see Jens today - help with a case you're working on.",{"option":"Get down to business","linkPath":"youExplainToJens","ifConditions":null,"notIfConditions":null}]},"youExplainToJens":{"content":["You explain to Jens that you are on the trail of a master criminal and need his help. You point out the unusual Beaufield investing activity you found during your earlier research. ",{"divert":"hmmTheresNoDoubt"},{"pageNum":-1}]},"hmmTheresNoDoubt":{"content":["\"Hmm, there's no doubt about it, Agent QC - that's someone who had inside information and knew when to get into BFD at a good price.\" says Jens. \"This purchasing was done not long before Osisko announced their finds on an adjacent lot - the stock price climbed right after this individual bought in.\"",{"divert":"jensStandsAndUnl"}]},"jensStandsAndUnl":{"content":["Jens stands and unlocks a large filing cabinet, beginning to rifle through voluminous folders and paperwork. \"Normally I wouldn't divulge this sort of information, even for the police, but if it's you, Agent QC, I'll make an exception.\" Jens hands you a sheaf of papers with purchase order information for large quantities of BFD. \"This is your man, agent. I hope it helps.\"",{"divert":"thePaperworkList"}]},"thePaperworkList":{"content":["The paperwork lists a purchase made in the name of one \"*-SascH-*\" - a known alias of Mr. Big Foot. You are able to connect the LLC used to purchase the shares to an address in *-Waterloo, ON-*. You thank Jens and make a note of the address.",{"option":"Continue investigation","linkPath":"whereShouldYouIn","ifConditions":null,"notIfConditions":null},{"flagName":"know waterloo"},{"flagName":"spoke to jens"},{"pageNum":-1}]},"youConsultYourCa":{"content":["You consult your *-Canada Revenue Agency -*contact about any irregularities that might help put you on the scent of Mr. Big Foot. ",{"divert":"theNumberOfCases"},{"flagName":"checked cra info"},{"pageNum":5},{"pageLabel":"CRA investigation"}]},"theNumberOfCases":{"content":["The number of cases to analyze is vast, and it takes some time to comb through them using search filters and different criteria to find the specific information that might connect to Mr. Big Foot - but you finally find something.",{"divert":"itSeemsThereIsAL"}]},"itSeemsThereIsAL":{"content":["It seems there is a large amount of trading activity happening on *-Vanguard Index funds -*and *-junior mining stocks-* in the *-CELI-*/*-TFSA-* of a certain individual. These stocks match the profile of suspected assets held by Mr. Big Foot. The automatic reporting of TFSA trading has helped put you on the trail.",{"divert":"itLooksLikeTheIn"}]},"itLooksLikeTheIn":{"content":["It looks like the individual owning these accounts is one \"*-SasH-*\" located in *-Waterloo, ON. -*",{"divert":"thisMatchesWhatY"}]},"thisMatchesWhatY":{"content":["This matches what you turned up earlier - Waterloo is definitely suspicious!",{"divert":"thankingTheCRAFo"},{"ifCondition":"know waterloo"}]},"thankingTheCRAFo":{"content":["Thanking the CRA for their assistance in the investigation, you prepare for the next phase of your inquiry.",{"option":"Continue investigation","linkPath":"whatIsYourNextSt","ifConditions":null,"notIfConditions":null},{"flagName":"know waterloo"}]},"whatIsYourNextSt":{"content":["What is your next step for this investigation?",{"option":"Contact the Mounted Police Special Active Futuristic Division to see if they have information","linkPath":"youReachOutToThe","ifConditions":null,"notIfConditions":[{"notIfCondition":"saw mpsafd briefing"}]},{"option":"Check for unusual movements in the stock market","linkPath":"youKnowMrBigFoot","ifConditions":null,"notIfConditions":null},{"option":"Check for unusual tax reporting information with the CRA","linkPath":"youConsultYourCa","ifConditions":null,"notIfConditions":[{"notIfCondition":"checked cra info"}]},{"option":"Finish gathering information and head to Waterloo to begin the hunt in person","linkPath":"youTakeAnUnmarke","ifConditions":[{"ifCondition":"know waterloo"}],"notIfConditions":null}]},"youTakeAnUnmarke":{"content":["You take an unmarked car and travel to Waterloo, Ontario. As soon as you cross the border out of Québec, you know you can no longer trust anyone - Mr. Big Foot has eyes and ears everywhere in this province.",{"divert":"youKnowBigFootIs"},{"pageNum":6},{"pageLabel":"Waterloo"}]},"youKnowBigFootIs":{"content":["You know Big Foot is operating out of this city somewhere, but you will need to look for signs of his activity in order to locate him and bring him to justice.",{"divert":"whereShouldYouSe"}]},"youVisitThePetSu":{"content":["You visit the pet supply store and establish surveillance. Mr. Big Foot may give himself away when purchasing supplies for pets, and you'll be here to catch him when he does.",{"divert":"butYoullNeedToNa"},{"pageNum":7},{"pageLabel":"Pet store"}]},"butYoullNeedToNa":{"content":["But you'll need to narrow your surveillance in order to catch him...",{"divert":"whatWillYouLookO"}]},"whatWillYouLookO":{"content":["What will you look out for at the pet store?",{"option":"People purchasing supplies for dogs","linkPath":"overDaysOfSurvei","ifConditions":null,"notIfConditions":[{"notIfCondition":"tried dogs"}]},{"option":"People purchasing supplies for cats","linkPath":"surveillanceOfPe","ifConditions":null,"notIfConditions":null},{"option":"People purchasing supplies for reptiles","linkPath":"decidingThatACri","ifConditions":null,"notIfConditions":[{"notIfCondition":"tried lizards"}]},{"option":"Give up on the Pet Store and try something else","linkPath":"whereShouldYouSe","ifConditions":null,"notIfConditions":null}]},"overDaysOfSurvei":{"content":["Over days of surveillance work at the pet stores, you see many dog owners come and go, but there's no one matching the known descriptions of Mr. Big Foot. It seems Mr. Big Foot may not be a dog person.",{"option":"Continue","linkPath":"whatWillYouLookO","ifConditions":null,"notIfConditions":null},{"flagName":"tried dogs"},{"pageNum":-1}]},"surveillanceOfPe":{"content":["Surveillance of people buying cat supplies initially turns up large quantities of kitty litter and canned salmon... but no leads on Mr. Big Foot.",{"divert":"howeverAfterAFew"}]},"howeverAfterAFew":{"content":["However, after a few days of this, you get a lead! A woman resembling a blurry photo of Mrs \"H\", believed to be Mr. Big Foot's partner in crime, is seen purchasing 20 lbs of dental care cat food. Not one to let this opportunity slip by, you discreetly follow her.",{"divert":"unfortunatelyMrs"}]},"unfortunatelyMrs":{"content":["Unfortunately, Mrs. \"H\" is adept at evading surveillance and is attempting to lose her pursuers even though she definitely has not seen you yet - she is just taking sudden turns and changing her route as a routine precaution. Eventually, you lose sight of her, but you have narrowed down Mr. Big Foot's residence to a small neighborhood. From here, you will be able to track him down by watching this small suburban area and narrow down which house is his.",{"option":"Move to neighborhood surveillance","linkPath":"youKnowMrBigFoot1","ifConditions":null,"notIfConditions":null}]},"decidingThatACri":{"content":["Deciding that a criminal mastermind such as Mr. Big Foot must own a reptile of some kind, you begin staking out the shoppers buying food and accessories for cold-blooded creatures (not lawyers but lizards). ",{"divert":"afterDaysOfWatch"}]},"afterDaysOfWatch":{"content":["After days of watching people leave with boxes of crickets for their snakes, or heating rocks for their iguanas, you finally give up. It seems Mr. Big Foot is not a lizard enthusiast.",{"option":"Continue","linkPath":"whatWillYouLookO","ifConditions":null,"notIfConditions":null},{"flagName":"tried lizards"}]},"youStakeOutTheGr":{"content":["You stake out the grocery store. Everyone needs to eat, and someone matching the description of Mr. Big Foot or one of his accomplices is sure to turn up here given enough time.",{"divert":"whatWillYouLookO1"},{"pageNum":8},{"pageLabel":"Grocery store"}]},"whatWillYouLookO1":{"content":["What will you look out for during surveillance of the grocery store?",{"option":"People purchasing high-quality steak","linkPath":"youObserveTheCom","ifConditions":null,"notIfConditions":[{"notIfCondition":"tried steak"}]},{"option":"People purchasing Calamari","linkPath":"mrBigFootsCrimin","ifConditions":null,"notIfConditions":[{"notIfCondition":"tried calamari"}]},{"option":"People purchasing cleaning supplies","linkPath":"aCriminalAlwaysH","ifConditions":null,"notIfConditions":[{"notIfCondition":"tried cleaning"}]},{"option":"People purchasing luxury cheeses","linkPath":"yourDecisionToKe","ifConditions":null,"notIfConditions":null},{"option":"People purchasing exotic fruits and vegetables","linkPath":"jackfruitKumquat","ifConditions":null,"notIfConditions":[{"notIfCondition":"tried vegetables"}]},{"option":"Forget the grocery store for now and change locations","linkPath":"whereShouldYouSe","ifConditions":null,"notIfConditions":null},{"pageNum":-1}]},"youObserveTheCom":{"content":["You observe the comings and goings in the meat department for weeks. Though a few wealthy-looking individuals do purchase high quality steaks, none of them matches the description of Mr. Big Foot or his known associates. It looks like all you'll have to end this steakout - er... I mean, /=stakeout=/.",{"option":"Continue","linkPath":"whatWillYouLookO1","ifConditions":null,"notIfConditions":null},{"flagName":"tried steak"},{"pageNum":-1}]},"mrBigFootsCrimin":{"content":["Mr. Big Foot's criminal empire extends tentacles into every corner of the financial world, and therefore he would be drawn to food that also has tentacles. At least, that's what you will have to tell your commander when you report that weeks of surveillance of the Calamari section at the store has turned up no leads as to Mr. Big Foot's whereabouts.",{"option":"Time to try something else then","linkPath":"whatWillYouLookO1","ifConditions":null,"notIfConditions":null},{"flagName":"tried calamari"},{"pageNum":-1}]},"aCriminalAlwaysH":{"content":["A criminal always has evidence to clean up - Mr. Big Foot is sure to need cleaning supplies. It made sense in your head, but after weeks of fruitless investigation you realize that Mr. Big Foot might be a bit of a slob - neither he nor any of his known associates have been spotted buying cleaning supplies. ",{"option":"Continue","linkPath":"whatWillYouLookO1","ifConditions":null,"notIfConditions":null},{"flagName":"tried cleaning"},{"pageNum":-1}]},"yourDecisionToKe":{"content":["Your decision to keep an eye on the luxury cheeses pays off! After a few days of observing the cheese aisle through a high-powered telescope, you spot a man matching the description of Mr. Big Foot as he leaves with a bag filled with aged cheddar, Havarti, friulano, brie and feta. This could be it - but if you act too soon, you risk alerting Mr. Big Foot to your presence and losing him. You'll need to tail him to his home in order to prepare for a proper arrest.",{"divert":"youTailHimAsHeLe"},{"pageNum":-1}]},"youTailHimAsHeLe":{"content":["You tail him as he leaves the store. Although your expert training prevents him from spotting you, he nevertheless is attempting to avoid being followed, seemingly as a routine precaution. You are able to keep up with him for some time, but eventually he vanishes through a nearby row of bushes and when you make it to the other side, he's long gone. ",{"divert":"howeverByFollowi"}]},"howeverByFollowi":{"content":["However, by following him this far, you have definitively narrowed down which neighborhood he lives in. You'll have to move fast and deduce where exactly he lives before he catches on to your investigation and escapes! ",{"option":"Begin investigating this neighborhood","linkPath":"youKnowMrBigFoot1","ifConditions":null,"notIfConditions":null}]},"jackfruitKumquat":{"content":["Jackfruit, kumquats, fennel, papaya, and many more - all these plant-based delicacies from around the world are sure to attract the attention of Mr. Big Foot. However, as the weeks go by, you don't catch even a glimpse of Mr. Big Foot or his associates. It seems he is not one to buy too many fancy fruits or vegetables... but if not those, then what?",{"option":"Continue","linkPath":"whatWillYouLookO1","ifConditions":null,"notIfConditions":null},{"flagName":"tried vegetables"},{"pageNum":-1}]},"whereShouldYouSe":{"content":["Where should you set up surveillance in order to catch Mr. Big Foot?",{"option":"Local dance studio","linkPath":"youEstablishSurv","ifConditions":null,"notIfConditions":[{"notIfCondition":"tried dance studio"}]},{"option":"Seafood restaurants","linkPath":"youEstablishSurv1","ifConditions":null,"notIfConditions":[{"notIfCondition":"tried seafood"}]},{"option":"Pet supply store","linkPath":"youVisitThePetSu","ifConditions":null,"notIfConditions":null},{"option":"Specialty grocery store","linkPath":"youStakeOutTheGr","ifConditions":null,"notIfConditions":null},{"option":"Snowboarding shop","linkPath":"youSetUpConstant","ifConditions":null,"notIfConditions":[{"notIfCondition":"tried snowboarding"}]},{"option":"Local banks","linkPath":"youSetUpInperson","ifConditions":null,"notIfConditions":[{"notIfCondition":"tried banks"}]}]},"youEstablishSurv":{"content":["You establish surveillance of the local dance studio. Around the clock, you observe the comings and goings as people learn ballroom dancing, east and west coast swing dancing, classical and jazz-tap... but none of the subjects match what is known about Mr. Big Foot. ",{"divert":"itSeemsThatThisW"}]},"itSeemsThatThisW":{"content":["It seems that this was not the right choice to hunt him down, but at least you've become a much better dancer in the meanwhile!",{"option":"Surveiller autre chose","linkPath":"whereShouldYouSe","ifConditions":null,"notIfConditions":null},{"flagName":"tried dance studio"}]},"youEstablishSurv1":{"content":["You establish surveillance of local seafood restaurants, hoping to catch sight of the wealthy Mr. Big Foot while he enjoys some high quality seafood with the city's elite.",{"divert":"afterWeeksOfSurv"},{"flagName":"tried seafood"}]},"afterWeeksOfSurv":{"content":["After weeks of surveillance, you observe a staggering amount of crab, lobster, salmon and oysters being consumed by the wealthy, but no leads on Mr. Big Foot. It seems seafood is not his favourite.",{"option":"On essayera quelque chose d'autre d'abord.","linkPath":"whereShouldYouSe","ifConditions":null,"notIfConditions":null}]},"youSetUpConstant":{"content":["You set up constant watch on the snowboarding supply store. Not one purchase of boards, skis or wax escapes your eye - googles, boots, gloves and jackets are all purchased while you observe from a safe distance. ",{"divert":"despiteYourVigil"}]},"despiteYourVigil":{"content":["Despite your vigilance, the search proves fruitless and after a few weeks you are forced to abandon this surveillance - it seems Mr. Big Foot is not a snowboarding fan.",{"option":"Try, try again. We'll look somewhere else.","linkPath":"whereShouldYouSe","ifConditions":null,"notIfConditions":null},{"flagName":"tried snowboarding"}]},"youSetUpInperson":{"content":["You set up in-person surveillance of local banks, keeping a watchful eye on comings and goings. However, after weeks of observing, you've seen no one that could be connected to Mr. Big Foot. Although he is heavily connected to the financial world, it seems he does most of his banking online and seldom appears in person at any bank.",{"option":"Try something else.","linkPath":"whereShouldYouSe","ifConditions":null,"notIfConditions":null},{"flagName":"tried banks"}]},"youKnowMrBigFoot1":{"content":["You know Mr. Big Foot lives somewhere in this small, quiet neighborhood. What will you investigate?",{"option":"Children playing in a nearby park","linkPath":"groupsOfHappyChi","ifConditions":null,"notIfConditions":[{"notIfCondition":"tried park"}]},{"option":"A group of cats basking under a tree near the road","linkPath":"youSeeThreeCatsR","ifConditions":null,"notIfConditions":null},{"option":"An open-air barbecue party on someone's front lawn down the street","linkPath":"thePartyLooksLik","ifConditions":null,"notIfConditions":[{"notIfCondition":"tried barbecue"}]},{"pageNum":9},{"pageLabel":" Neighborhood Surveillance"}]},"groupsOfHappyChi":{"content":["Groups of happy children play in the park nearby, while their parents make small talk or enjoy a moment of peace. Though you keep a close eye out, there's no sign of Mr. Big Foot. It seems he doesn't have kids and doesn't go to the park much. So much for this idea... time is running out to track him down!",{"option":"Continue","linkPath":"youKnowMrBigFoot1","ifConditions":null,"notIfConditions":null},{"flagName":"tried park"}]},"thePartyLooksLik":{"content":["The party looks like a lot of fun - groups of adults are walking around enjoying cocktails and barbecued burgers on the lawn, mingling and crooning along to the amazing music of the late, great Michel Louvain. You have a wonderful time at the party while looking for Mr. Big Foot, but in the end there is no sign of him. Looks like he is not much of a party animal.",{"divert":"timeIsRapidlyRun"},{"flagName":"tried barbecue"}]},"timeIsRapidlyRun":{"content":["Time is rapidly running out to find him - you'd better hurry!",{"option":"Continue","linkPath":"youKnowMrBigFoot1","ifConditions":null,"notIfConditions":null}]},"youSeeThreeCatsR":{"content":["You see three cats reclining in the grass beneath a maple tree in a large parkette near the road. You could try following one of these cats and seeing if it takes you to Mr. Big Foot... but which one might be his, if any?",{"divert":"thereIsALargeBla"},{"pageNum":10},{"pageLabel":"Cat following"}]},"thereIsALargeBla":{"content":["There is a large *-black cat -*here lying on its back, leaving its belly exposed to the sunlight. This cat looks like it's been made to wear a harness, probably used to take it for walks on a leash. As you approach the black cat, it turns its head to greet you and waits for you to come up and rub its belly. It has no fear of you at all.",{"divert":"thereIsALonghair"}]},"thereIsALonghair":{"content":["There is a long-haired *-gray cat -*sitting right next to the tree, keeping an eye on you. As you approach it, this cat makes no move to run away and in fact seems ready to approach you and say hello. It is very friendly and comfortable with you.",{"divert":"aSmallCalicoCatI"}]},"aSmallCalicoCatI":{"content":["A small *-calico cat-* is crouching under a hedge nearby. It looks at you nervously and seems ready to flee at any moment. Its tail flicks anxiously.",{"divert":"youCanFollowOneO"}]},"youCanFollowOneO":{"content":["You can follow one of the cats when it wanders home... but which one do you think might belong to Mr. Big Foot?",{"option":"Follow the large black cat","linkPath":"theBlackCatWatch","ifConditions":null,"notIfConditions":null},{"option":"Follow the fluffy gray cat","linkPath":"thePoofyGrayCatS","ifConditions":null,"notIfConditions":[{"notIfCondition":"tried fluffy cat"}]},{"option":"Follow the small calico cat","linkPath":"asYouMoveToTailT","ifConditions":null,"notIfConditions":[{"notIfCondition":"tried calico"}]}]},"theBlackCatWatch":{"content":["The black cat watches you approach and sits up as you get near - it seems this cat didn't want to wait for you to walk up to him, but rather wants pats RIGHT NOW! ",{"divert":"heAmblesTowardYo"}]},"heAmblesTowardYo":{"content":["He ambles toward you and headbutts your leg gently, winding himself around your shins in a figure-8 as he demands to be patted. It seems this cat is very affectionate!",{"divert":"afterSomeTimeHeB"}]},"afterSomeTimeHeB":{"content":["After some time, he begins to wander off, stopping along the way to greet several strangers and say hello by giving them an affectionate head bonk. At length, the cat reaches what seems to be his home - an unremarkable house across from the park. ",{"divert":"aFoldingChairOnT"}]},"aFoldingChairOnT":{"content":["A folding chair on the front step indicates that someone here likes to sit on their step while on the telephone with their family, watching their cats enjoy the outdoors. Could this be the residence of Mr. Big Foot?",{"divert":"theBlackCatEnter"}]},"theBlackCatEnter":{"content":["The black cat enters the house through a small cat flap. As it does, you catch a glimpse of a man inside the house through the window - no doubt about it, it's Mr. Big Foot! He matches the description perfectly. ",{"option":"Continue","linkPath":"atLastItsTimeToB","ifConditions":null,"notIfConditions":null}]},"thePoofyGrayCatS":{"content":["The poofy gray cat spends quite a while near the tree, boldly approaching strangers and showing no fear of passing cars or the wind. Eventually, it wanders to its home, followed by you. ",{"divert":"whenYouGetALookA"},{"flagName":"tried fluffy cat"}]},"whenYouGetALookA":{"content":["When you get a look at the owners of the cat, however, you know you have made a mistake: it's your old buddy *-Claude Lemasson, -*CEO of Eastmain Resources! There's no way he could be Mr. Big Foot since you were golfing with him at the time of several of Mr. Big Foot's crimes. ",{"divert":"theresNoTimeToSa"}]},"theresNoTimeToSa":{"content":["There's no time to say hello to Claude - you need to act fast and follow another cat before you lose your chance!",{"option":"Continue","linkPath":"youCanFollowOneO","ifConditions":null,"notIfConditions":null}]},"asYouMoveToTailT":{"content":["As you move to tail the small calico cat, it darts away from you and vanishes into the bushes. After no small amount of time and effort, you pursue the cat to its home - a nest in an old cardboard box in the woods. It seems this is a stray cat! ",{"option":"Go back and follow another cat","linkPath":"youCanFollowOneO","ifConditions":null,"notIfConditions":null},{"option":"Bring this cat to the Humane Society first","linkPath":"notWantingToAban","ifConditions":null,"notIfConditions":null},{"flagName":"tried calico"}]},"notWantingToAban":{"content":["Not wanting to abandon this poor stray cat, you manage to safely collect it in a cat carrier and bring it to the local Waterloo Humane Society. They take the calico off your hands and ask you if it has a name already.",{"option":"Say its name is \"Antoine\"","linkPath":"hisNameIsAntoine","ifConditions":null,"notIfConditions":null},{"option":"Say its name is \"Marie\"","linkPath":"herNameIsMarieTh","ifConditions":null,"notIfConditions":null},{"option":"Say its name is \"Roch\"","linkPath":"hisNameIsRochYou","ifConditions":null,"notIfConditions":null},{"pageNum":-1}]},"hisNameIsAntoine":{"content":["\"His name is Antoine\" you say to the woman at the desk, handing over the calico cat. \"Please make sure he finds a good home - he can be a difficult at times, but he has a good heart.\"",{"option":"Hurry back and follow a different cat","linkPath":"youCanFollowOneO","ifConditions":null,"notIfConditions":null},{"flagName":"antoine cat"}]},"herNameIsMarieTh":{"content":["\"Her name is 'Marie-Thérèse' and she is very sweet,\" you explain as you hand over the stray cat. \"She is very wise and kind, and is always happy to see people. Please find her a good home.\" ",{"divert":"theWomanAtTheDes"},{"pageNum":-1}]},"theWomanAtTheDes":{"content":["The woman at the desk thanks you and takes Marie from you. ",{"option":"Hurry back and try to follow another cat","linkPath":"youCanFollowOneO","ifConditions":null,"notIfConditions":null},{"flagName":"marie cat"},{"pageNum":-1}]},"hisNameIsRochYou":{"content":["\"His name is 'Roch',\" you explain as you drop off the cat. \"He is pretty odd but very clever and helpful. He loves to make music at all hours. Please find him a good home.\"",{"divert":"theWomanAtTheDes1"},{"flagName":"roch cat"},{"pageNum":-1}]},"theWomanAtTheDes1":{"content":["The woman at the desk thanks you and takes Roch in her arms. Time to get back to the case!",{"option":"Go back and try following a different cat","linkPath":"youCanFollowOneO","ifConditions":null,"notIfConditions":null},{"pageNum":-1}]},"atLastItsTimeToB":{"content":["At last it's time to bring Mr. Big Foot to justice! you know he is in this house. However, in order to make sure he is convicted, it will be necessary to collect as much evidence as possible from his computer. If you call in a raid, there is a risk he will erase his hard disk in the meanwhile. ",{"divert":"youllNeedToFindA"},{"pageNum":11},{"pageLabel":" Final Showdown"}]},"youllNeedToFindA":{"content":["You'll need to find a way to bring him to his front door and arrest him quickly before he has a chance to act.",{"divert":"ifYouRingHisDoor"}]},"ifYouRingHisDoor":{"content":["If you ring his doorbell, what will you say to make him come to the door in person, and quickly? There's not much time to act, you'll have to improvise!",{"divert":"youStepUpAndRing"}]},"youStepUpAndRing":{"content":["You step up and ring the doorbell of the house. You hear footsteps inside approaching the door. With the door still closed and locked, a suspicious voice on the other side barks out: \"What do you want?\"",{"option":"Pretend to be delivering a pizza","linkPath":"pizzaDeliveryYou","ifConditions":null,"notIfConditions":null},{"option":"Pretend to be delivering a box of choose-your-own-adventure books","linkPath":"youSayIHaveADeli","ifConditions":null,"notIfConditions":null},{"option":"Pretend to be delivering financial documents from his brokerage","linkPath":"youClearYourThro","ifConditions":null,"notIfConditions":null},{"option":"Pretend to be selling chocolate bars","linkPath":"tryingYourBestTo","ifConditions":null,"notIfConditions":null}]},"pizzaDeliveryYou":{"content":["\"Pizza delivery!\" you say in your best pizza-guy impression. \"Extra cheese and pineapples sir!\" Mr. Big Foot instantly replies with enthusiasm: \"Oh! Pizza! Come right in!\"",{"divert":"theDoorUnlocksAn"},{"flagName":"pizza"}]},"theDoorUnlocksAn":{"content":["The door unlocks and you make your move...",{"option":"Continue","linkPath":"youBurstInTheDoo","ifConditions":null,"notIfConditions":null}]},"youSayIHaveADeli":{"content":["You say: \"I have a delivery here - a big box of 'Choose Your Own Adventure' books. Is this the right address?\"",{"divert":"immediatelyTheMa"}]},"immediatelyTheMa":{"content":["Immediately the man on the other side of the door replies \"Oh boy! I'll take everything you've got! Just a second!\" ",{"divert":"theDoorIsImmedia"},{"flagName":"cyoa"}]},"theDoorIsImmedia":{"content":["The door is immediately unlocked and you make your move. ",{"option":"Burst in and arrest him","linkPath":"youBurstInTheDoo","ifConditions":null,"notIfConditions":null}]},"youClearYourThro":{"content":["You clear your throat and try to sound respectable: \"I'm just delivering this big pile of financial documents - shareholder updates, balance statements, that sort of thing.\"",{"divert":"theVoiceOnTheOth"},{"flagName":"financial"}]},"theVoiceOnTheOth":{"content":["The voice on the other side of the door becomes excited \"Ooooh! I LOVE financial documents! I hope I've got some cool shareholder voting forms to fill out! Just one moment.\"",{"divert":"theDoorUnlocksIt"}]},"theDoorUnlocksIt":{"content":["The door unlocks - it's time to act fast!",{"option":"Burst into the house and arrest him.","linkPath":"youBurstInTheDoo","ifConditions":null,"notIfConditions":null}]},"tryingYourBestTo":{"content":["Trying your best to sound like someone selling chocolate bars door to door, you say \"Oh, just selling these big boxes of chocolate bars door to door. I guess if you don't want any, I'll move on...\" ",{"divert":"instantlyTheVoic"}]},"instantlyTheVoic":{"content":["Instantly, the voice inside the house cuts you off \"No wait! I love chocolate bars! If you have almond milk chocolate, I'll take 20!\" ",{"divert":"theDoorUnlocksAn1"},{"flagName":"chocolate"}]},"theDoorUnlocksAn1":{"content":["The door unlocks and you make your move.",{"option":"Burst in and arrest Mr. Big Foot!","linkPath":"youBurstInTheDoo","ifConditions":null,"notIfConditions":null}]},"youBurstInTheDoo":{"content":["You burst in the door and put Mr. Big Foot under arrest. The large, bald, bearded man before you is obviously as devious as he is handsome, but even the most hardened criminals have their weakness. You've masterfully gained access and can now slap the cuffs on him before he can erase any evidence from his hard disk.",{"divert":"soonYourBackupAr"},{"pageNum":12},{"pageLabel":" Final bust"}]},"soonYourBackupAr":{"content":["Soon your backup arrives and begins gathering evidence from the premises for use in an eventual court case - stacks of trade confirmations in TFSAs and RRSPs showing all manner of fishy business or insider trading. This will make sure he is put away for a nice long time. Now that he's been brought to justice, we no longer need to be undercover and can switch back to /=le bon francais.=/",{"divert":"TantQueVousLuiSo"}]},"TantQueVousLuiSo":{"content":[" Tant que vous lui sortez en menottes, vous vous permettez un moment de triomphe: \"Vous étiez subtil, M. Big Foot - mais contre le super agent #1 'QC', toute votre subtilité fut plutôt de /=l'inutilité.=/ Trouvez vous un bon avocat - vous en aurez besoin!\" Ce dit, vous lui mettez dans la voiture de police. ",{"divert":"furieuxIlVousCri"}]},"furieuxIlVousCri":{"content":["Furieux, il vous crie une dernière menace juste avant que la porte de la voiture ne ferme:",{"divert":"mentirAuSujectDu"}]},"mentirAuSujectDu":{"content":["\"Mentir au suject du chocolat! Je ne vous pardonnerai jamais, Agent QC!\"",{"divert":"utiliserMonAmour"},{"ifCondition":"chocolate"}]},"utiliserMonAmour":{"content":["\"Utiliser mon amour de la lecture pour me pieger! Non mais quelle audace! Je ne vous pardonnerai jamais, Agent QC!\"",{"divert":"commentOsezvousD"},{"ifCondition":"cyoa"}]},"commentOsezvousD":{"content":["\"Comment osez-vous dire que vous aviez une pizza sans vraiment en avoir une! Quel horrible déception! Je ne vous pardonnerai jamais, Agent QC!\"",{"divert":"quelTrahisonDeMe"},{"ifCondition":"pizza"}]},"quelTrahisonDeMe":{"content":["\"Quel trahison, de me dire que vous aviez des documents pour actionnaires! Vous savez bien que c'est ma seule faiblesse! Je ne vous pardonnerai jamais, Agent QC!\"",{"divert":"MaintenantQueVou"},{"ifCondition":"financial"}]},"MaintenantQueVou":{"content":[" Maintenant que vous avez capturé le redoutable criminel Mr. Big Foot, que ferez vous?",{"option":"Aller peinturer","linkPath":"vousRetournezChe","ifConditions":null,"notIfConditions":null},{"option":"Aller en campagne","linkPath":"vousDemarrezVotr","ifConditions":null,"notIfConditions":null},{"option":"Visiter le calico","linkPath":"VousNavezPasOubl","ifConditions":[{"ifCondition":"antoine cat"}],"notIfConditions":null},{"option":"Visiter le calico","linkPath":"VousNavezPasOubl","ifConditions":[{"ifCondition":"marie cat"}],"notIfConditions":null},{"option":"Visiter le calico","linkPath":"VousNavezPasOubl","ifConditions":[{"ifCondition":"roch cat"}],"notIfConditions":null}]},"vousRetournezChe":{"content":["Vous retournez chez vous et vous mettez a peinturer un beau paysage. Enfin la paix est revenue au Québec grâce a vos efforts. ",{"divert":"fIN"}]},"fIN":{"content":["/=FIN=/"]},"vousDemarrezVotr":{"content":["Vous demarrez votre voiture et conduisez a votre maison de campagne. Içi, au bord du lac, vous passez un beau moment sous un soleil d'été, finnisant par vous endormir en hamac. ",{"divert":"fIN1"}]},"fIN1":{"content":["/=FIN=/"]},"VousNavezPasOubl":{"content":[" Vous n'avez pas oublié le petit chat calico que vous avez trouvé durant l'enquête. Vous retournez a la société protectrice des animaux.",{"divert":"estceQueRochEstT"}]},"estceQueRochEstT":{"content":["\"Est-ce que Roch est toujours içi?\" ",{"divert":"estceQueMarieEst"},{"ifCondition":"roch cat"}]},"estceQueMarieEst":{"content":["\"Est-ce que Marie est toujours içi?\"",{"divert":"estceQueAntoineE"},{"ifCondition":"marie cat"}]},"estceQueAntoineE":{"content":["\"Est-ce que Antoine est toujours içi?\" ",{"divert":"laRceptionisteVo"},{"ifCondition":"antoine cat"}]},"laRceptionisteVo":{"content":["La réceptioniste vous offre un sourire et dit que oui, en effet, le calico que vous avez amené tantôt est sain et sauf. ",{"divert":"caPrendPeuDeTemp"}]},"caPrendPeuDeTemp":{"content":["Ca prend peu de temps avant que vous décidez d'adopter le chat. Vous devenez de bons amis et passez de bonnes années ensembles.",{"divert":"fin"}]},"fin":{"content":["/=Fin=/"]}},"initial":"bonjourAgentQC","optionMirroring":true,"allowCheckpoints":false,"editorData":{"playPoint":"whatIsYourNextSt","libraryVisible":true,"authorName":"Jaston Echo","textSize":0}},"url_key":55078}